Управление_торговлей.ПБТ/src/Documents/АктПриемаОбразцов/АктПриемаОбразцов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктПриемаОбразцов</name>
  <basedOn>Document.АктОтбора</basedOn>
  <registerRecords>AccumulationRegister.ОтборОбразцов</registerRecords>
  <registerRecords>InformationRegister.СтатусыОбразцов</registerRecords>
  <attributes>
    <name>ДатаНачалаИсследований</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.АктОтбора</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ_Образцы</name>
    <attributes>
      <name>ДокументПоступления</name>
      <type>
        <types>DocumentRef.АктОтбора</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПродукта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрОбразцы</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧ_ВидыИсследований</name>
    <attributes>
      <name>ВидИсследования</name>
      <type>
        <types>CatalogRef.ВидыИсследований</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МассаОбразца</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиТЧОбразцы</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Образец</name>
      <type>
        <types>CatalogRef.ЛабораторныйОбразец</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/Documents/АктПриемаОбразцов/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТЧ_ОбразцыПриАктивизацииСтроки(Элемент)
	
	Данные = Элементы.ТЧ_Образцы.ТекущиеДанные;
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	//устанавливаем идентификатор если он пустой
	Если НЕ ЗначениеЗаполнено(Данные.ИдентификаторСтрОбразцы) Тогда 
		Данные.ИдентификаторСтрОбразцы = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	//устанавливаем отбор в подчиненных табличных частях
	Элементы.ТЧ_ВидыИсследований.ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтрокиТЧОбразцы", Данные.ИдентификаторСтрОбразцы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ОбразцыПередУдалением(Элемент, Отказ)
	
	Данные = Элементы.ТЧ_Образцы.ТекущиеДанные;
	Отбор = Новый Структура("ИдентификаторСтрокиТЧОбразцы",Данные.ИдентификаторСтрОбразцы);
	Масс = Объект.ТЧ_ВидыИсследований.НайтиСтроки(Отбор);
	Для каждого Строка из Масс Цикл
		Объект.ТЧ_ВидыИсследований.Удалить(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Первоначальное заполнение объекта.
	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.Пользователь = Пользователи.ТекущийПользователь(); 
		
	КонецЕсли;
	
КонецПроцедуры
